---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SlantedColumnTopExtension
source: html/1a4f77d8-811c-b5e8-ca73-9f7ba14c73d0.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SlantedColumnTopExtension Property

"Top Extension"

## Syntax (C#)
```csharp
public static ForgeTypeId SlantedColumnTopExtension { get; }
```